# Указываем базовый образ для Node.js
FROM node AS build

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы package.json и package-lock.json
COPY package*.json ./

# Устанавливаем зависимости для серверной части
RUN npm install

# Копируем серверную часть
COPY . .

# Переходим в директорию клиента
WORKDIR /app/CLIENT

# Устанавливаем зависимости для клиентской части
RUN npm install

# Собираем клиентскую часть
RUN npm run build

# Возвращаемся в корневую директорию
WORKDIR /app

# Команда по умолчанию для запуска сервера и клиента
CMD ["npm", "run", "dev"]


# # Указываю базовый образ, который будем использовать для создания контейнера
# FROM node 

# # Устанавливаю рабочую директорию внутри контейнера
# WORKDIR /app

# # Копирую все файлы из текущего контекста сборки внутрь контейнера в директорию /app
# COPY . .

# # Запускаю установку зависимостей Node.js из файла package.json
# RUN npm install


# # Открываю порт 1111 в контейнере, чтобы он был доступен извне
# EXPOSE 1111

# # Задаю команду по умолчанию для запуска контейнера
# CMD ["npm", "start"]
