# Указываю базовый образ для Node.js
FROM node AS build

# Устанавливаю рабочую директорию
WORKDIR /app

# Копирую файлы package.json и package-lock.json
COPY package*.json ./

# Устанавливаю зависимости для серверной части
RUN npm install

# Копирую серверную часть
COPY . .

# Перехожу в директорию клиента
WORKDIR /app/CLIENT

# Устанавливаю зависимости для клиентской части
RUN npm install

# Собираю клиентскую часть
RUN npm run build

# Возвращаюсь в корневую директорию
WORKDIR /app

# Открываю порт 1111 в контейнере, чтобы он был доступен извне
EXPOSE 80:1111

# Команда по умолчанию для запуска сервера и клиента
CMD ["npm", "run", "dev"]

