 
# run:
	# docker run -p 2525:1111 webdotg

# -d (detach): запуск контейнера в фоновом режиме 

# -p 80:1111 (port mapping): привязывает порт 80 хост-системы к порту 1111 внутри контейнера
# любые запросы на порт 80 хост-системы, 
# будут перенаправлены на порт 1111 внутри контейнера.

# --env-file .env (environment file): использование переменных окружения .env. 
#  переменные окружения в файле могут быть использованы внутри контейнера.
#  удобный способ передачи конфигурационных параметров внутрь контейнера.

# -v dataTest:/app/data (volume mounting): создает том (volume)
# полезно для сохранения данных или файлов вне контейнера, 
# обеспечивает сохранность после удаления контейнера. 

# --rm (remove): автоматически удалить контейнер после его остановки

# --name webdotg (container name): задает имя контейнера 

# stop:
	# docker stop webdotg